#' Title
#'
#' @param initial_year
#' @param project_year
#' @param dt
#'
#' @return
#' @export
#'
#' @examples
project_table <- function(initial_year = 2020, project_year = 1, dt) {
  year <- c(initial_year:(initial_year + project_year - 1))
  # pt = list()

  ### t1a
  t1a <- data.frame(cbind(year, dt[[1]][, 2], dt[[2]][, 2], dt[[3]][, 2]))
  t1a <- t1a[-1, ]
  colnames(t1a)[1:4] <- c("年份", "低方案(人)", "中方案(人)", "高方案(人)")

  ### t2a
  t2a <- data.frame(cbind(
    year,
    dt[[1]][, 3], round(dt[[1]][, 3] / dt[[1]][, 2] * 1000, 2),
    dt[[2]][, 3], round(dt[[2]][, 3] / dt[[2]][, 2] * 1000, 2),
    dt[[3]][, 3], round(dt[[3]][, 3] / dt[[3]][, 2] * 1000, 2)
  ))
  t2a <- t2a[-1, ]
  colnames(t2a) <- c(
    "年份",
    "低出生人数(人)", "低出生率(‰)",
    "中出生人数(人)", "中出生率(‰)",
    "高出生人数(人)", "高出生率(‰)"
  )

  ### t3a
  t3a <- data.frame(cbind(
    year,
    dt[[1]][, 4], round(dt[[1]][, 4] / dt[[1]][, 2] * 1000, 2),
    dt[[2]][, 4], round(dt[[2]][, 4] / dt[[2]][, 2] * 1000, 2),
    dt[[3]][, 4], round(dt[[3]][, 4] / dt[[3]][, 2] * 1000, 2)
  ))
  t3a <- t3a[-1, ]
  colnames(t3a) <- c(
    "年份",
    "低死亡人数(人)", "低死亡率(‰)",
    "中死亡人数(人)", "中死亡率(‰)",
    "高死亡人数(人)", "高死亡率(‰)"
  )

  ### t4a
  t4a <- data.frame(cbind(
    year,
    (round(dt[[1]][, 3] - dt[[1]][, 4])), round((dt[[1]][, 3] - dt[[1]][, 4]) / dt[[1]][, 2] * 1000, 2),
    (round(dt[[2]][, 3] - dt[[2]][, 4])), round((dt[[2]][, 3] - dt[[2]][, 4]) / dt[[2]][, 2] * 1000, 2),
    (round(dt[[3]][, 3] - dt[[3]][, 4])), round((dt[[3]][, 3] - dt[[3]][, 4]) / dt[[3]][, 2] * 1000, 2)
  ))
  t4a <- t4a[-1, ]
  colnames(t4a) <- c(
    "年份",
    "低自然增长人数(人)", "低自然增长率(‰)",
    "中自然增长人数(人)", "中自然增长率(‰)",
    "高自然增长人数(人)", "高自然增长率(‰)"
  )

  ### t5a
  t5a <- data.frame(cbind(
    year,
    dt[[1]][, 5], round(dt[[1]][, 5] / dt[[1]][, 2] * 100, 2),
    dt[[2]][, 5], round(dt[[2]][, 5] / dt[[2]][, 2] * 100, 2),
    dt[[3]][, 5], round(dt[[3]][, 5] / dt[[3]][, 2] * 100, 2)
  ))
  t5a <- t5a[-1, ]
  colnames(t5a) <- c(
    "年份",
    "低0-14岁人数(人)", "低比重(%)",
    "中0-14岁人数(人)", "中比重(%)",
    "高0-14岁人数(人)", "高比重(%)"
  )

  ### t6a
  t6a <- data.frame(cbind(
    year,
    dt[[1]][, 6], round(dt[[1]][, 6] / dt[[1]][, 2] * 100, 2),
    dt[[2]][, 6], round(dt[[2]][, 6] / dt[[2]][, 2] * 100, 2),
    dt[[3]][, 6], round(dt[[3]][, 6] / dt[[3]][, 2] * 100, 2)
  ))
  t6a <- t6a[-1, ]
  colnames(t6a) <- c(
    "年份",
    "低15-59岁人数(人)", "低比重(%)",
    "中15-59岁人数(人)", "中比重(%)",
    "高15-59岁人数(人)", "高比重(%)"
  )

  ### t7a
  t7a <- data.frame(cbind(
    year,
    dt[[1]][, 7], round(dt[[1]][, 7] / dt[[1]][, 2] * 100, 2),
    dt[[2]][, 7], round(dt[[2]][, 7] / dt[[2]][, 2] * 100, 2),
    dt[[3]][, 7], round(dt[[3]][, 7] / dt[[3]][, 2] * 100, 2)
  ))
  t7a <- t7a[-1, ]
  colnames(t7a) <- c(
    "年份",
    "低15-64岁人数(人)", "低比重(%)",
    "中15-64岁人数(人)", "中比重(%)",
    "高15-64岁人数(人)", "高比重(%)"
  )

  ### t8a
  t8a <- data.frame(cbind(
    year,
    dt[[1]][, 8], round(dt[[1]][, 8] / dt[[1]][, 2] * 100, 2),
    dt[[2]][, 8], round(dt[[2]][, 8] / dt[[2]][, 2] * 100, 2),
    dt[[3]][, 8], round(dt[[3]][, 8] / dt[[3]][, 2] * 100, 2)
  ))
  t8a <- t8a[-1, ]
  colnames(t8a) <- c(
    "年份",
    "低60岁及以上人数(人)", "低比重(%)",
    "中60岁及以上人数(人)", "中比重(%)",
    "高60岁及以上人数(人)", "高比重(%)"
  )

  ### t9a
  t9a <- data.frame(cbind(
    year,
    dt[[1]][, 9], round(dt[[1]][, 9] / dt[[1]][, 2] * 100, 2),
    dt[[2]][, 9], round(dt[[2]][, 9] / dt[[2]][, 2] * 100, 2),
    dt[[3]][, 9], round(dt[[3]][, 9] / dt[[3]][, 2] * 100, 2)
  ))
  t9a <- t9a[-1, ]
  colnames(t9a) <- c(
    "年份",
    "低65岁及以上人数(人)", "低比重(%)",
    "中65岁及以上人数(人)", "中比重(%)",
    "高65岁及以上人数(人)", "高比重(%)"
  )

  ### t10a
  t10a <- data.frame(cbind(
    year,
    dt[[1]][, 10], round(dt[[1]][, 9] / dt[[1]][, 2] * 100, 2),
    dt[[2]][, 10], round(dt[[2]][, 9] / dt[[2]][, 2] * 100, 2),
    dt[[3]][, 10], round(dt[[3]][, 9] / dt[[3]][, 2] * 100, 2)
  ))
  t10a <- t10a[-1, ]
  colnames(t10a) <- c(
    "年份",
    "低80岁及以上人数(人)", "低比重(%)",
    "中80岁及以上人数(人)", "中比重(%)",
    "高80岁及以上人数(人)", "高比重(%)"
  )

  ### t11a
  t11a <- data.frame(cbind(
    year,
    round(dt[[1]][, 5] / dt[[1]][, 7] * 100, 2),
    round(dt[[2]][, 5] / dt[[2]][, 7] * 100, 2),
    round(dt[[3]][, 5] / dt[[3]][, 7] * 100, 2),
    round(dt[[1]][, 9] / dt[[1]][, 7] * 100, 2),
    round(dt[[2]][, 9] / dt[[2]][, 7] * 100, 2),
    round(dt[[3]][, 9] / dt[[3]][, 7] * 100, 2)
  ))
  t11a <- t11a[-1, ]
  colnames(t11a) <- c(
    "年份",
    "低少儿抚养比(%)",
    "中少儿抚养比(%)",
    "高少儿抚养比(%)",
    "低老年抚养比(%)",
    "中老年抚养比(%)",
    "高老年抚养比(%)"
  )

  pt <- list(t1a, t2a, t3a, t4a, t5a, t6a, t7a, t8a, t9a, t10a, t11a)
  return(pt)
}
